# Источники данных для анализа метрики retention

## UserEntry
- **Описание:** лог заходов пользователей на платформу.
- **Поля:**
 - `user_id`: уникальный идентификатор пользователя.
 - `entry_at`: дата и время входа пользователя на платформу.

## Users
- **Описание:** данные о пользователях, включая регистрацию и активность.
- **Поля:**
 - `user_id`: уникальный идентификатор пользователя.
 - `registration_date`: дата регистрации пользователя.
 - `activity_level`: уровень активности пользователя (например, количество действий на платформе).

## CodeSubmit
- **Описание:** попытки пользователей решить задачи.
- **Поля:**
 - `user_id`: уникальный идентификатор пользователя.
 - `problem_id`: идентификатор задачи.
 - `created_at`: дата и время попытки решения задачи.
 - `is_false`: флаг, указывающий на успешность решения задачи (0 — успешно, 1 — неуспешно).

## Transaction
- **Описание:** транзакции пользователей, связанные с CodeCoins.
- **Поля:**
 - `user_id`: уникальный идентификатор пользователя.
 - `type_id`: тип транзакции (например, покупка, продажа).
 - `amount`: сумма транзакции.
 - `timestamp`: дата и время транзакции.

